# Import Libraries

In [1]:
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

# Import customers dataset

In [2]:
path=r'C:\Users\Usha Bharati\Downloads\02-2024 Instacart Basket Analysis'

In [3]:
df_customers=pd.read_csv(os.path.join(path,'02 Data','Original Data','customers.csv'))

In [4]:
df_customers.shape

(206209, 10)

In [4]:
df_customers.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

# Q4 Wrangle the data so that it follows consistent logic

# Renaming columns from the dataframe

In [5]:
df_customers.rename(columns={'First Name': 'first_name', 'Surnam': 'surname', 'STATE': 'state', 'date_joined': 'join_date', 'n_dependants': 'count_of_dependants', 'fam_status': 'family_status'}, inplace=True)

In [6]:
df_customers.head()

,user_id,first_name,surname,Gender,state,Age,join_date,count_of_dependants,family_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

# Q5 Complete the fundamental data quality and consistency checks

# Checking for Missing Values

In [7]:
df_customers.isnull().sum()

user_id                    0
first_name             11259
surname                    0
Gender                     0
state                      0
Age                        0
join_date                  0
count_of_dependants        0
family_status              0
income                     0
dtype: int64

# The output shows that,missing values are there only in the column 'first_name'

In [8]:
df_customers[df_customers['first_name'].isnull()==True]

,user_id,first_name,surname,Gender,state,Age,join_date,count_of_dependants,family_status,income
53,76659,NaN,Gilbert,Male,Colorado,26,1/1/2017,2,married,41709
73,13738,NaN,Frost,Female,Louisiana,39,1/1/2017,0,single,82518
82,89996,NaN,Dawson,Female,Oregon,52,1/1/2017,3,married,117099
99,96166,NaN,Oconnor,Male,Oklahoma,51,1/1/2017,1,married,155673
105,29778,NaN,Dawson,Female,Utah,63,1/1/2017,3,married,151819
...,...,...,...,...,...,...,...,...,...,...
206038,121317,NaN,Melton,Male,Pennsylvania,28,3/31/2020,3,married,87783
206044,200799,NaN,Copeland,Female,Hawaii,52,4/1/2020,2,married,108488
206090,167394,NaN,Frost,Female,Hawaii,61,4/1/2020,1,married,45275
206162,187532,NaN,Floyd,Female,California,39,4/1/2020,0,single,56325
206171,116898,NaN,Delgado,Female,Colorado,23,4/1/2020,2,married,59222

# first_name column dropped from the dataframe.

In [21]:
df_customers=df_customers.drop (columns=['first_name'])

In [22]:
df_customers.head()

,user_id,surname,Gender,state,Age,join_date,count_of_dependants,family_status,income
0,26711,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

# Checking for duplicates

In [9]:
 df_customers_dups=df_customers[df_customers.duplicated()]

In [10]:
df_customers_dups

Empty DataFrame
Columns: [user_id, first_name, surname, Gender, state, Age, join_date, count_of_dependants, family_status, income]
Index: []

## There are no duplicates in the dataframe.

# Converting any mixed-type data

In [11]:
df_customers.dtypes

user_id                 int64
first_name             object
surname                object
Gender                 object
state                  object
Age                     int64
join_date              object
count_of_dependants     int64
family_status          object
income                  int64
dtype: object

# As statistics for the column user_id would not make sense, so it is converted from int to object.

In [12]:
df_customers['user_id'] = df_customers['user_id'].astype('str')

In [13]:
df_customers.dtypes

user_id                object
first_name             object
surname                object
Gender                 object
state                  object
Age                     int64
join_date              object
count_of_dependants     int64
family_status          object
income                  int64
dtype: object

In [15]:
df_customers.describe()

                 Age  count_of_dependants         income
count  206209.000000        206209.000000  206209.000000
mean       49.501646             1.499823   94632.852548
std        18.480962             1.118433   42473.786988
min        18.000000             0.000000   25903.000000
25%        33.000000             0.000000   59874.000000
50%        49.000000             1.000000   93547.000000
75%        66.000000             3.000000  124244.000000
max        81.000000             3.000000  593901.000000

# Mixed data type

In [23]:
for col in df_customers.columns.tolist():
    weird = (df_customers[[col]].map(type) != df_customers[[col]].iloc[0].apply(type)).any(axis=1)
    if len(df_customers[weird]) > 0:
        print(col)

# No mixed data type in any column.

# Q6 Combine customer data with the rest of prepared Instacart data.

# Importing prepared Instacart data

In [28]:
ords_prods_merge_derived=pd.read_pickle(os.path.join(path, '02 Data','Prepared Data', 'ords_prods_merge_derived.pkl'))

In [52]:
ords_prods_merge_derived.head()

,product_id,product_name,aisle_id,department_id,prices,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,...,price_range_loc,busiest_day,busiest_days,busiest_period_of_day,max_order,loyalty_flag,average_spending,spending_flag,median_days_since_prior_order,frequency_flag
0,1,Chocolate Sandwich Cookies,61,19,5.8,3139998,138,28,6,11,...,Mid range product,Regularly busy,Regularly busy,Most Orders,32,Regular customer,6.935811,Low spender,8.0,Frequent customer
1,1,Chocolate Sandwich Cookies,61,19,5.8,1977647,138,30,6,17,...,Mid range product,Regularly busy,Regularly busy,Average Orders,32,Regular customer,6.935811,Low spender,8.0,Frequent customer
2,1,Chocolate Sandwich Cookies,61,19,5.8,389851,709,2,0,21,...,Mid range product,Busiest day,Busiest days,Average Orders,5,New customer,7.930208,Low spender,8.0,Frequent customer
3,1,Chocolate Sandwich Cookies,61,19,5.8,652770,764,1,3,13,...,Mid range product,Regularly busy,Slowest days,Most Orders,3,New customer,4.972414,Low spender,9.0,Frequent customer
4,1,Chocolate Sandwich Cookies,61,19,5.8,1813452,764,3,4,17,...,Mid range product,Least busy,Slowest days,Average Orders,3,New customer,4.972414,Low spender,9.0,Frequent customer

In [29]:
ords_prods_merge_derived.columns

Index(['product_id', 'product_name', 'aisle_id', 'department_id', 'prices',
       'order_id', 'user_id', 'order_number', 'orders_day_of_week',
       'order_hour_of_day', 'days_since_prior_order', 'add_to_cart_order',
       'reordered', 'price_range_loc', 'busiest_day', 'busiest_days',
       'busiest_period_of_day', 'max_order', 'loyalty_flag',
       'average_spending', 'spending_flag', 'median_days_since_prior_order',
       'frequency_flag'],
      dtype='object')

In [30]:
df_customers.columns

Index(['user_id', 'surname', 'Gender', 'state', 'Age', 'join_date',
       'count_of_dependants', 'family_status', 'income'],
      dtype='object')

# Merging both the datframes on column 'user_id'

# Changed the datatype of user_id in df_customers to int64 so that it is same as the user_id datatype in ords_prods_merge_derived dataframe

In [46]:
df_customers['user_id'] = df_customers['user_id'].astype('int64')

In [47]:
df_customers.dtypes

user_id                 int64
surname                object
Gender                 object
state                  object
Age                     int64
join_date              object
count_of_dependants     int64
family_status          object
income                  int64
dtype: object

In [48]:
df_all_merged=ords_prods_merge_derived.merge(df_customers, on = 'user_id',indicator=True)

In [50]:
df_all_merged['_merge'].value_counts()

_merge
both          32404859
left_only            0
right_only           0
Name: count, dtype: int64

In [51]:
df_all_merged.head()

,product_id,product_name,aisle_id,department_id,prices,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,...,frequency_flag,surname,Gender,state,Age,join_date,count_of_dependants,family_status,income,_merge
0,1,Chocolate Sandwich Cookies,61,19,5.8,3139998,138,28,6,11,...,Frequent customer,Cox,Male,Minnesota,81,8/1/2019,1,married,49620,both
1,1,Chocolate Sandwich Cookies,61,19,5.8,1977647,138,30,6,17,...,Frequent customer,Cox,Male,Minnesota,81,8/1/2019,1,married,49620,both
2,907,Premium Sliced Bacon,106,12,20.0,3160996,138,1,5,13,...,Frequent customer,Cox,Male,Minnesota,81,8/1/2019,1,married,49620,both
3,907,Premium Sliced Bacon,106,12,20.0,2254091,138,10,5,14,...,Frequent customer,Cox,Male,Minnesota,81,8/1/2019,1,married,49620,both
4,1000,Apricots,18,10,12.9,505689,138,9,6,12,...,Frequent customer,Cox,Male,Minnesota,81,8/1/2019,1,married,49620,both

In [53]:
df_all_merged.shape

(32404859, 32)

In [54]:
df_all_merged.columns

Index(['product_id', 'product_name', 'aisle_id', 'department_id', 'prices',
       'order_id', 'user_id', 'order_number', 'orders_day_of_week',
       'order_hour_of_day', 'days_since_prior_order', 'add_to_cart_order',
       'reordered', 'price_range_loc', 'busiest_day', 'busiest_days',
       'busiest_period_of_day', 'max_order', 'loyalty_flag',
       'average_spending', 'spending_flag', 'median_days_since_prior_order',
       'frequency_flag', 'surname', 'Gender', 'state', 'Age', 'join_date',
       'count_of_dependants', 'family_status', 'income', '_merge'],
      dtype='object')

# Export this new dataframe as a pickle file

In [55]:
df_all_merged.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'df_all_merged.pkl'))